; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_3 ?v2 - type_2 ?v8 - type_1)
 	      (pred_2 ?v6 - object ?v8 - type_1)
	      (pred_1 ?v2 - type_2 ?v7 - type_3)
	      (pred_4 ?v2 - type_2 ?v6 - object ?v7 - type_3))

   (:action op_2
       :parameters  (?v2 - type_2 ?v4 ?v1 - type_1)
       :precondition (and  (pred_3 ?v2 ?v4))
       :effect (and  (pred_3 ?v2 ?v1)
		     (not (pred_3 ?v2 ?v4))))

   (:action op_3
       :parameters (?v2 - type_2 ?v5 - object ?v3 - type_1 ?v7 - type_3)
       :precondition  (and  (pred_2 ?v5 ?v3) (pred_3 ?v2 ?v3) (pred_1 ?v2 ?v7))
       :effect (and (pred_4 ?v2 ?v5 ?v7)
		    (not (pred_2 ?v5 ?v3)) 
		    (not (pred_1 ?v2 ?v7))))

   (:action op_1
       :parameters (?v2 - type_2 ?v5 - object ?v3 - type_1 ?v7 - type_3)
       :precondition  (and  (pred_4 ?v2 ?v5 ?v7) (pred_3 ?v2 ?v3))
       :effect (and (pred_2 ?v5 ?v3)
		    (pred_1 ?v2 ?v7)
		    (not (pred_4 ?v2 ?v5 ?v7)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_09 - type_2
obj_08 obj_10 - type_3
obj_07 obj_02 obj_01 obj_06 - type_1
obj_05 obj_03 obj_04 - object)
(:init
(pred_3 obj_09 obj_01)
(pred_1 obj_09 obj_08)
(pred_1 obj_09 obj_10)
(pred_2 obj_05 obj_02)
(pred_2 obj_03 obj_07)
(pred_2 obj_04 obj_07)
)
(:goal
(and
(pred_2 obj_05 obj_07)
(pred_2 obj_03 obj_01)
(pred_2 obj_04 obj_02)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_4 obj_09 ?b obj_10))))
)
)

; plan
1. (op_2 obj_09 obj_01 obj_07)
   deleted: (pred_3 obj_09 obj_01)
   added: (pred_3 obj_09 obj_07)
   goals met: 0 of 3
2. (op_3 obj_09 obj_03 obj_07 obj_08)
   deleted: (pred_2 obj_03 obj_07) (pred_1 obj_09 obj_08)
   added: (pred_4 obj_09 obj_03 obj_08)
   goals met: 0 of 3
3. (op_2 obj_09 obj_07 obj_01)
   deleted: (pred_3 obj_09 obj_07)
   added: (pred_3 obj_09 obj_01)
   goals met: 0 of 3
4. (op_1 obj_09 obj_03 obj_01 obj_08)
   deleted: (pred_4 obj_09 obj_03 obj_08)
   added: (pred_2 obj_03 obj_01) (pred_1 obj_09 obj_08)
   goals met: 1 of 3
5. (op_2 obj_09 obj_01 obj_02)
   deleted: (pred_3 obj_09 obj_01)
   added: (pred_3 obj_09 obj_02)
   goals met: 1 of 3
6. (op_3 obj_09 obj_05 obj_02 obj_08)
   deleted: (pred_2 obj_05 obj_02) (pred_1 obj_09 obj_08)
   added: (pred_4 obj_09 obj_05 obj_08)
   goals met: 1 of 3
7. (op_2 obj_09 obj_02 obj_07)
   deleted: (pred_3 obj_09 obj_02)
   added: (pred_3 obj_09 obj_07)
   goals met: 1 of 3
8. (op_1 obj_09 obj_05 obj_07 obj_08)
   deleted: (pred_4 obj_09 obj_05 obj_08)
   added: (pred_2 obj_05 obj_07) (pred_1 obj_09 obj_08)
   goals met: 2 of 3
9. (op_3 obj_09 obj_04 obj_07 obj_08)
   deleted: (pred_2 obj_04 obj_07) (pred_1 obj_09 obj_08)
   added: (pred_4 obj_09 obj_04 obj_08)
   goals met: 2 of 3
10. (op_2 obj_09 obj_07 obj_02)
   deleted: (pred_3 obj_09 obj_07)
   added: (pred_3 obj_09 obj_02)
   goals met: 2 of 3
11. (op_1 obj_09 obj_04 obj_02 obj_08)
   deleted: (pred_4 obj_09 obj_04 obj_08)
   added: (pred_2 obj_04 obj_02) (pred_1 obj_09 obj_08)
   goals met: 3 of 3
